week_num = int(input("Введіть номер тижня (1 або 2): "))
day = input("Введіть день тижня (Понеділок, Вівторок, Середа, Четвер, П’ятниця): ")

if week_num == 1:
    if day.lower() == "понеділок":
        print("1 тиждень, Понеділок: Математика, Англійська мова")
    elif day.lower() == "вівторок":
        print("1 тиждень, Вівторок: Історія, Біологія")
    elif day.lower() == "середа":
        print("1 тиждень, Середа: Фізика, Математика")
    elif day.lower() == "четвер":
        print("1 тиждень, Четвер: Географія, Хімія")
    elif day.lower() == "п’ятниця":
        print("1 тиждень, П’ятниця: Література, Англійська мова")
    else:
        print("Невірно введений день тижня")
elif week_num == 2:
    if day.lower() == "понеділок":
        print("2 тиждень, Понеділок: Математика, Фізкультура")
    elif day.lower() == "вівторок":
        print("2 тиждень, Вівторок: Історія, Література")
    elif day.lower() == "середа":
        print("2 тиждень, Середа: Географія, Музика")
    elif day.lower() == "четвер":
        print("2 тиждень, Четвер: Біологія, Математика")
    elif day.lower() == "п’ятниця":
        print("2 тиждень, П’ятниця: Англійська мова, Хімія")
    else:
        print("Невірно введений день тижня")
else:
    print("Невірно введений номер тижня")
