C = ["Товар1", "Товар2", "Товар3", "Товар4", "Товар5", "Товар6", "Товар7", "Товар8", "Товар9", "Товар10", "Товар11", "Товар12", "Товар13", "Товар14", "Товар15", "Товар16", "Товар17", "Товар18", "Товар19", "Товар20"]
A = [10, 5, 20, 15, 30, 10, 8, 12, 45, 3, 7, 22, 18, 14, 50, 2, 9, 33, 21, 11]
B = [100, 200, 150, 300, 50, 400, 120, 80, 60, 1000, 45, 90, 210, 130, 25, 500, 110, 75, 140, 190]

total_value = 0
for i in range(len(A)):
    total_value += A[i] * B[i]

average_price = sum(B) / len(B)
max_quantity_index = A.index(max(A))
most_stocked_product = C[max_quantity_index]

print(f"Загальна вартість: {total_value}")
print(f"Середня ціна: {average_price}")
print(f"Найбільше на складі: {most_stocked_product}")